var webData ={
		headerDesc: ['禧樹景觀自2000年7月成立以來,以"認真、用心、負責"的精神深植,創新、熱情的持續擴大經營,服務廣大客戶。禧樹景觀公司,逐漸走向企業化和規模化經營,企業文化的使命為 「優化人生始於設計,景觀設計止於生態順勢」;願景是以成為「全國最佳生態景觀設計領導者」為目標。英文企業名稱Silver Spire,有著禧樹的銀色樹梢、閃亮的枝枒意思之外,更代表了璀璨的靈感及頂尖的技術等等意義。', '禧樹景觀,分別經營項目為設計、工程及花市;一直以來,禧樹工程團隊在每個專案當中,從整體規劃、設計到施工,皆由專業團隊執行,創造出獨特的風格,巧妙的運用不同的元素,拉近了人們與藝術、自然之美的距離,不論風格、空間大小,皆能適宜的表現精緻的景觀,提升視覺及心靈的饗宴。', '禧樹花市,致力打造一座花園,擺脫以往花市紛亂、擁擠的印象,讓客人在逛花市也能輕鬆、優雅、舒服的享受花草的生命力。禧樹花市營業項目包含花草賣場、禮籃盆栽、精緻組合盆栽、進口花器、園藝資材等,未來欲集合花市及咖啡餐飲,一個充滿新意的消費型態,提供多元的購物樂趣。'],
		headerContact: {
			_time: '08：00 - 21：30',
			phone: '04-2437-5260',
			fox: '04-2437-5267',
			email: 'shi.shu@msa.hinet.net',
			addr: '台中市東山路一段378-8號',
			gmap: 'http://goo.gl/maps/wZI6q'
		},
		meatDesc: ['原產於中亞非及美洲大陸,主要生長於極端乾燥的環境,像是海濱、高山、沙漠等區域;多肉植物的根、莖、葉特化成為肥厚的肉質,可儲存水分的器官,用以抵抗乾旱,種類超過上萬種以上。', '多肉生長茁壯,要給予半日照甚至全日照的室外環境。多肉植物耐旱、耐乾,非常怕熱潮濕,為避免其根系、葉片腐爛,日常給水、介質調配與環境通風度要特別注意。'],
		airDesc: [
			'空氣鳳梨是地球上唯一一種完全生於空氣的植物,不須種在土中就能生長茂盛。由於它具有觀賞價值,相較於其他植物容易存活,非常適合現代生活忙碌,但又想綠化居住環境的植物首選。空氣鳳梨不必種在土壤裡,可由葉面的絨毛吸收空氣中的水氣和氮化合物,不需要特別用心地照顧也能生長良好。','蘭花,聖潔高雅,為花中四君子之一,品種繁多。孔子曰:「芝蘭生於深谷,不以無人而不芳;君子修道立德。不為困窮而改節。」 蘭花的生命力和環境的適應能力,比多數的花草強韌,花朵優美雅麗、花色鮮明,蘭花除了常見的盆栽栽培外,它也是種耐久高貴的切花材料。'
		],
		flavorDesc: [
			'許多人愛上種香草植物,不外乎是為了它天然的香氣,種在花園裡自然能被它的香氣給牽引;走到庭院,摘一些迷迭香、紫蘇、羅勒或是百里香入菜,搭配肉類、魚類料理,;亦或是在下午茶時光,泡一杯薰衣草茶,都能感受到香草植物帶給人的迷人氣息,最重要的是自己吃的東西自己種,安心感提升。'
			],
		suitDesc: ['專業、精緻、巧妙的搭配各式植栽,年節禮籃、居家盆器裝飾、送禮花籃,提供客製化組合服務,送人自用兩相宜。'],
		lifeDesc: ['各式園藝資材、園藝 DIY 器具、書籍 販售。素燒盆器,紅土低溫窯燒,盆器本身充滿了細微的孔洞,是一種會呼吸的花器。由於素燒的特性,植物種在盆中,土壤能夠自然的透水、透氣,非常適合放置戶外庭園;質樸的質感,經年累月後,表面形成自然的復刻感,苔癬附著的色澤,是時間和季節換來的無價之寶。'],
		seasonDesc:['喜歡自己動手 DIY,種一些花花草草,除了細心照料,隨著季節的變遷,某些草花汰換,也是很重要的環節。每種植物,都有不同的特性,在某些季節是繁花期、落葉期或是結果收成的時節。生命,都是一個無常的周期,就連植物也是,但能夠在一生中,努力的生長、開花、結果,當下一個季節來臨時,又會是一個美好的開始。'],
		waterDesc: [
			'水景可依業主需求分為生態池及一般水景。生態池是由自然景石所砌成的圍邊,彎曲的曲線營造出與自然環境類似的生態環境,搭配流水與水生植物,打造出在家也能享受郊外野溪、水瀑的水景。一般水景則是運用水牆或是簡單流水所營造的水幕瀑布,即便是陽台空間也能呈現出想要的效果。'
			],
		floatDesc: [
			'都市中高樓大廈林立,人們的生活空間,漸漸地已經形成垂直發展,因此綠化的空間逐漸不再只能在" 地上" ;打造一座在頂樓的空中祕密花園,屬於個人的專屬城堡,增加休憩綠化的空間,是一種屬於都市的浪漫享受。'
			],
		gardenDesc:[
			'依照業主需求打造出理想的私人花園,在家也能享受置身國外的度假氛圍。透過專業、巧妙的植栽搭配、細膩的施工手法,讓植物生長在適當的空間,整體能夠完美的展現出道地的異國風味。'
			],
		balconyDesc: [
			'大多數公寓、大樓的住戶,只能以擺放盆栽來滿足美化空間的慾望,但重新整頓、規劃陽台的空間,也能有效利用小空間,來創造新世界。運用木地板、礫石舖面,提升陽台空間的溫度和質感,或是手工打造、獨一無二的造型洗手台,再依照業主理想中的風格、形式,搭配合適的植栽,讓窗外的端景,不再只有堆積的物品,是充滿著感動和生命感。'
			],
		contact:[
			'台中市北屯區松竹路一段 37 號',
			'禧樹花市 Tel : 04- 2437-0585',
			'禧樹景觀 Tel : 04- 2437-5260',
			'Fax : 2437-5267',
			
		],
		mainImgs: ['data/main/main1.jpg', 'data/main/main2.jpg', 'data/main/main3.jpg'],
		subImgs: [
					{title: '景觀作品', img:'data/main/sub1.jpg', link: 'projects'},
					{title: '工程實績', img: 'data/main/sub4.jpg', link: 'works'},
					{title: '園藝資材', img: 'data/main/sub2.jpg', link: 'resource'}, 
					{title: '盆栽組合', img: 'data/main/sub3.jpg', link: 'kits'} 
				],
		flickr: {
			userId: 'silver.spire',
			apiKey: '8bf6cf083c6449eba4c5cb2b1948e259',
			secret: 'd1f64fa70f3dd7c0',
			sets: {
				projects: '72157651068343325,72157651294111842,72157650896421478,72157648981475873,72157651068433615',
				works: '72157651294111842',
				resource: '72157651294111842',
				kits: '72157650968209518',
				news: '72157655427283949'
			}

		}
	}

module.exports = function (key) {
	if (typeof webData[key] === 'undefined') {
		return;
	}
	return webData[key];

};